DDam_OverInterDyMFoam/CASE20/backgroundAndMovingObject/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 8e-5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    
    bed1
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    
    bed2
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    
    movingObject
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
