DDam_OverInterDyMFoam/CASE20/backgroundAndMovingObject/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

11
(
    oversetPatch
    {
        type            overset;
        inGroups        1(overset);
        nFaces          0;
        startFace       496365;
    }
    frontAndbackBackground
    {
        type            empty;
        inGroups        1(empty);
        nFaces          493760;
        startFace       496365;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          320;
        startFace       990125;
    }
    bed1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          772;
        startFace       990445;
    }
    bed2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          771;
        startFace       991217;
    }
    top
    {
        type            patch;
        nFaces          1543;
        startFace       991988;
    }
    oversetPatch1
    {
        type            overset;
        inGroups        1(overset);
        nFaces          262;
        startFace       993531;
    }
    oversetPatch2
    {
        type            overset;
        inGroups        1(overset);
        nFaces          262;
        startFace       993793;
    }
    frontAndBack1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2404;
        startFace       994055;
    }
    frontAndBack2
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2404;
        startFace       996459;
    }
    movingObject
    {
        type            wall;
        inGroups        1(wall);
        nFaces          476;
        startFace       998863;
    }
)

// ************************************************************************* //
