DDam_OverInterDyMFoam/CASE20/backgroundAndMovingObject/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue zoneID 123
);

regions
(
    boxToCell
    {
        box ( -100 -100 -100 ) ( 0.99 100 0 );
        fieldValues 
        ( 
            volScalarFieldValue alpha.water 1 
        );
    }
    boxToCell
    {
        box ( 0.997 -100 -100 ) ( 1.98 100 0 );
        fieldValues 
        ( 
            volScalarFieldValue alpha.water 1 
        );
    }
    boxToCell
    {
        box ( 1.98 -100 -100 ) ( 100 100 -0.55 );
        fieldValues 
        ( 
            volScalarFieldValue alpha.water 1 
        );
    }

    cellToCell
    {
        set c0;

        fieldValues
        (
            volScalarFieldValue zoneID 0
        );
    }
    cellToCell
    {
        set c1;

        fieldValues
        (
            volScalarFieldValue zoneID 1
        );
    }
    cellToCell
    {
        set c2;

        fieldValues
        (
            volScalarFieldValue zoneID 2
        );
    }
);

// ************************************************************************* //
